import re

def transaction_search(transactions_list: list[dict], search_string: str) -> str | list[dict]:
    """Поиск транзакции  по описанию (Простой поиск)"""

    if not isinstance(transactions_list, list):
        return "Неверный формат операций, должен быть список"

    try:
        transactions = []
        for transaction in transactions_list:
            description = transaction.get("Описание")
            if isinstance(description, str):
                if re.search(search_string, description, flags=re.IGNORECASE):
                    transactions.append(transaction)
        return transactions

    except (TypeError, AttributeError): #Обрабатываем также ошибки при работе с re.search
        return "Произошла ошибка при поиске. Убедитесь, что формат данных верен."

transactions_list_test = [{
        "Дата операции": "04.01.2018 15:00:41",
        "Статус": "OK",
        "Категория": "Каршеринг",
        "Номер карты": "*7199",
        "Сумма операции": 1025.0,
        "Сумма платежа": 1025.0,
        "Описание": "Оплата денег",
        "Кэшбэк": 'nan',
        "Бонусы (включая кэшбэк)": 20,
    },
    {
        "Дата операции": "04.01.2018 15:00:41",
        "Статус": "OK",
        "Категория": "Каршеринг",
        "Номер карты": "*7199",
        "Сумма операции": -25.0,
        "Сумма платежа": -25.0,
        "Кэшбэк": 'nan',
        "Бонусы (включая кэшбэк)": 20,
    },
    {
        "Дата операции": "04.01.2018 14:05:08",
        "Статус": "OK",
        "Категория": "Каршеринг",
        "Номер карты": "*7197",
        "Сумма операции": -1065.9,
        "Сумма платежа": -1065.9,
        "Кэшбэк": 'nan',
        "Бонусы (включая кэшбэк)": 21,
    },
    {
        "Дата операции": "03.01.2018 15:03:35",
        "Статус": "OK",
        "Категория": "Каршеринг",
        "Номер карты": "*7197",
        "Сумма операции": -73.06,
        "Сумма платежа": -73.06,
        "Описание": "Перевод денег",
        "Кэшбэк": 'nan',
        "Бонусы (включая кэшбэк)": 1,
    },
    {
        "Дата операции": "03.01.2018 14:55:21",
        "Статус": "OK",
        "Категория": "Каршеринг",
        "Номер карты": "*7197",
        "Сумма операции": -21.0,
        "Сумма платежа": -21.0,
        "Описание": "Оплата за товар",
        "Кэшбэк": 'nan',
        "Бонусы (включая кэшбэк)": 0,
    },
    {
        "Дата операции": "01.01.2018 20:27:51",
        "Статус": "OK",
        "Категория": "Каршеринг",
        "Номер карты": "*7197",
        "Сумма операции": -316.0,
        "Сумма платежа": -316.0,
        "Описание": "Перевод денег",
        "Кэшбэк": 'nan',
        "Бонусы (включая кэшбэк)": 6,
    },
    {
        "Дата операции": "01.01.2018 12:49:53",
        "Статус": "Failed",
        "Категория": "Каршеринг",
        "Номер карты": 'nan',
        "Сумма операции": -3000.0,
        "Сумма платежа": -3000.0,
        "Описание": "Перевод денег",
        "Кэшбэк": 'nan',
        "Бонусы (включая кэшбэк)": 0,
    }]

search_string = "оплата"

print(transaction_search(transactions_list_test,search_string))